{"intro":"The past decade, Asian representation in Hollywood has skyrocketed. Asian Americans, like ourselves, have been able to see the nuances of our lives reflected on the big screen.\r\n\r\n\r\nBut as part of this progress, we’ve experienced exactly what Haimei felt watching *Emily in Paris*: The excitement of seeing our lives represented in popular media, only to realize that these characters fall short. Not only do these characters fail to represent who we are; they can reinforce harmful misconceptions, generalizations, and biases.","history":"For much of US history, this was a common experience for Asian American filmgoers. The early 1900s saw white actors donning [“yellowface”](https://www.history.com/news/yellowface-whitewashing-in-film-america) to play some of the most prominent Asian characters, including Charlie Chan and Dr. Fu Manchu. Exaggerated ‘racial’ features—including ‘slanted’ eyes, a yellow skin color, black hair, and a mocking ‘Asian’ accent—were common.","stereotypes":"As the Asian American population grew, particularly with the passage of [the Immigration and Nationality Act of 1965](https://www.loc.gov/classroom-materials/immigration/chinese/a-new-community), Asians became more visible in Hollywood. But when Asian actors were cast, they were often portrayed with stereotypes, like Bruce Lee being confined to martial arts roles or Nancy Kwan repeatedly cast as a ‘Dragon Lady.’","dataTransition":"To explore this further we compiled more than 3,500 films from the 1980s to 2020s with Asian actors. We winnowed it down to films where Asian actors played a major role, getting us to 500 films. From there, we filtered the list down to films where the character’s Asian ethnicity was an important part of the storyline. Ultimately we found **80 films** with **165 Asian actors** playing **236 characters**.","start":[{"visible_years":"1982-1995","opaque_years":"1982-1995","highlight_movies":"2","text":"Through the late 1960s, Hollywood was still using white actors in “yellowface” to portray Asian people. So the 1980s marked an important breakthrough, when films like <span>Indiana Jones and the Temple of Doom (1984)</span> starred child actor Ke Huy Quan alongside some of Hollywood’s biggest names."},{"visible_years":"1982-1995","opaque_years":"1982-1995","highlight_movies":"78","text":"Then came <span>The Joy Luck Club (1993)</span>, a landmark movie that was the first to feature a majority Asian American cast. The movie follows four Chinese American mothers and daughters, highlighting the complexities of immigration.\r\n\r\n\r\nThis film launched the careers of several Asian actors. Ming-Na Wen, who plays June, said the film was her [“green card to Hollywood.”](https://www.nytimes.com/2018/09/09/movies/joy-luck-club-crazy-rich-asians.html) But director Wayne Wang struggled to gain momentum in directing more Asian-centered stories, and it would be decades before we would see another major film with a large Asian cast."},{"visible_years":"1982-2009","opaque_years":"1996-2009","highlight_movies":"15","text":"Starting in the late-1990s, movies like <span>Crouching Tiger, Hidden Dragon (2000)</span> brought Asian stories to mainstream audiences. Actors like Michelle Yeoh, Jackie Chan, and Tony Leung Chiu-wai began to build prominent, international careers. For the first time, a surge of Asian stars were driving significant box office success."},{"visible_years":"1982-2009","opaque_years":"1996-2009","highlight_movies":"4,34","text":"Still, this representation didn’t always make us proud. Many Asian main characters were still confined to stereotypes, such as Jackie Chan being a martial artist in <span>Rush Hour (1998)</span> or the “oriental” women in <span>Memoirs of a Geisha(2005)</span>."},{"visible_years":"1982-2023","opaque_years":"2010-2023","highlight_movies":"","text":"In the 2010s, we started to see Asian characters in varying roles with a more in-depth characterization. From 2007 to 2022, the percentage of Asian characters with speaking roles [increased from 3.4% to 15.9%](https://time.com/6305012/hollywood-diversity-report-asian-representation/), the biggest growth of any racial group in that time period."},{"visible_years":"1982-2023","opaque_years":"2010-2023","highlight_movies":"63,71","text":"These days, Asian actors no longer play just stereotypes; they are full characters—love interests, superheroes, and even the modern-day American family. \r\n\r\n\r\nRecent films like <span>Shang-Chi and the Legend of the Ten Rings (2021)</span> and <span>Joy Ride (2023)</span> have highlighted a diverse set of stories across all genres."}],"pastDecade":"This new era for Asian representation has been further cemented by the widespread success of movies like *Crazy Rich Asians (2018)*, *Minari (2020)*, and *Everything Everywhere All At Once (2022)*.","identity":"Asian Americans, like Haimei, are now more likely to see their own cultural backgrounds reflected in film, and these distinctions in culture matter. According to a [2023 poll by the Pew Research Center](https://www.pewresearch.org/race-and-ethnicity/2023/05/08/diverse-cultures-and-shared-experiences-shape-asian-american-identities/), many Asian Americans feel more closely aligned with their specific ethnicity, like “Chinese” or “Thai”, rather than broadly “Asian”. That’s why it’s especially exciting to see our specific customs, cuisines, and languages reflected on the big screen.","thesis":"But that gets us back to Haimei’s original complaint: How common is it for Asian characters to be played by an actor of a different ethnicity? When we first broached this question, we immediately thought of several examples. In the popular TV show *Fresh Off the Boat*, Korean American actor Randall Park plays a Chinese American character who speaks poor Mandarin. In the show Kim’s Convenience, Chinese-Canadian actor Simu Liu plays a Korean-Canadian character, Jung Kim. \r\n\r\n\r\nSo, honestly, we expected to find a plethora of mismatches.","end":[{"visible_years":"1982-2023","opaque_years":"1982-2023","highlight_movies":"","text":"We started with the **80 films** and **236 characters** in our dataset."},{"visible_years":"1982-2023","opaque_years":"1982-2023","highlight_movies":"","characteristic_shown":"isFullyAccurate","characteristic_dim":"isPartiallyAccurate,isFullyInaccurate","text":"Out of 80 movies we looked at, **64** were cast with <span class='accurate'>complete accuracy</span>."},{"visible_years":"1982-2023","opaque_years":"1982-2023","highlight_movies":"","characteristic_shown":"isFullyAccurate,isPartiallyAccurate","characteristic_dim":"isFullyAccurate,isFullyInaccurate","text":"Meanwhile, **13** movies were cast with <span class='partial_accurate'>partial accuracy</span>."},{"visible_years":"1982-2023","opaque_years":"1982-2023","highlight_movies":"","characteristic_shown":"isFullyAccurate,isPartiallyAccurate,isFullyInaccurate","characteristic_dim":"isFullyAccurate,isPartiallyAccurate","text":"And only **3** out of the 80 movies were cast <span class='fully_inaccurate'>completely inaccurately</span>.\r\n\r\n\r\nThese three films were more obscure—and chances are, you’ve never even heard of them, like *Missing in Action (1984)* or* A Hologram for the King (2016)*."},{"visible_years":"1982-2023","opaque_years":"1982-2023","highlight_movies":"","characteristic_shown":"isFullyAccurate,isPartiallyAccurate,isFullyInaccurate","characteristic_dim":"isFullyAccurate,isPartiallyAccurate","text":"Notably, it’s not an Asian actor’s fault that they are playing a character of a different ethnicity. In the past, being Asian greatly limited the types of roles available in Hollywood, so actors had to take what was available to them in a white-centric industry."},{"visible_years":"1982-2023","opaque_years":"1982-2023","character_color":"1","highlight_movies":"","characteristic_shown":"isFullyAccurate,isPartiallyAccurate,isFullyInaccurate","characteristic_dim":"","text":"All in all, of the 236 Asian main characters, 207—**87%**—were portrayed by actors of the <span class='accurate'>same ethnic background</span>.\r\n\r\n\r\nThis was a higher portion than we’d expected! We were ready to blame Hollywood, but it turns out casting directors have been paying attention to Asian actors’ ethnicities."},{"visible_years":"1982-2023","opaque_years":"1982-2023","highlight_movies":"","characteristic_shown":"isFullyAccurate,isPartiallyAccurate,isFullyInaccurate","characteristic_dim":"isNotBig5","text":"That said, there were some factors that influenced accurate—and inaccurate—casting. \r\n\r\n\r\nFor example, the **“Big Five” production studios**—Universal, Paramount, Warner Bros., Disney, and Sony—control nearly 85% of the movie market share. With more resources, these large studios have the means to reach mainstream audiences and feature bigger stars.\r\n\r\n\r\nBut they were responsible for just **39%** of the 80 movies."},{"visible_years":"1982-2023","opaque_years":"1982-2023","highlight_movies":"37,63","characteristic_shown":"isFullyAccurate,isPartiallyAccurate,isFullyInaccurate","characteristic_dim":"isNotBig5","text":"Still, “Big Five” studios are behind some of the most celebrated films with Asian characters, including <span>Crazy Rich Asians (2018)</span> and <span>Shang-Chi and the Legend of the Ten Rings (2021)</span>.  And when they do a fairly good job of accurately casting actors—about **86%**, on par with other studios."},{"visible_years":"1982-2023","opaque_years":"1982-2023","highlight_movies":"","characteristic_shown":"isFullyAccurate,isPartiallyAccurate,isFullyInaccurate","characteristic_dim":"isNotAsianDirector","text":"Meanwhile, movies with **Asian directors** had a **94%** accuracy rate, well above the average for non-Asian directors.\r\n\r\n\r\nWhat’s clear is that when Asian filmmakers get the opportunity to make movies, casting is done with more intentionality and accuracy."},{"visible_years":"1982-2023","opaque_years":"1982-2023","highlight_movies":"66","characteristic_shown":"isFullyAccurate,isPartiallyAccurate,isFullyInaccurate","characteristic_dim":"isNotAsianDirector","text":"Asians directors have also recently begun receiving more recognition, with <span>Everything Everywhere All At Once (2022)</span> director Daniel Kwan becoming the first Asian director to win the Oscar for Best Director for an Asian-led film."},{"visible_years":"1982-2023","opaque_years":"1982-2023","highlight_movies":"","characteristic_shown":"isFullyAccurate,isPartiallyAccurate,isFullyInaccurate","characteristic_dim":"","text":"**Explore these films by hovering on the chart.**"}],"conclusion":"This project was prompted by the disheartening experiences we’ve had watching miscast characters in popular media, so we came into this project expecting more miscastings than not. And it’s not just us. A [study published in 2025](https://www.mckinsey.com/featured-insights/diversity-and-inclusion/from-margins-to-mainstream-asians-and-pacific-islanders-in-hollywood) showed that less than 30% of APIs feel like they are represented in the media. This is especially important when there is so little representation of our cultures to begin with. To Asian Americans, this sends the message that Hollywood—and America as a whole—still sees Asians as one big monolith.\r\n\r\n\r\nWhen our analysis found that most films were accurately cast, it was unexpected and empowering!\r\n\r\n\r\nWe also know how fragile this progress is. In 2024, racial and gender diversity in Hollywood [decreased for the first time in six years](https://newsroom.ucla.edu/releases/hollywood-diversity-in-decline-as-moviegoers-worldwide-want-more), part of a larger trend of diminishing diversity. Even so, diversity and representation aren’t just about seeing Asian actors on screen. In a [recent interview](https://www.nbcnews.com/news/asian-america/constance-wu-the-friend-movie-hollywood-diversity-rcna198408), Constance Wu said that she’s noticed that representation is becoming less important in casting. She said this could be a sign of people in Hollywood “reverting to limited imaginations of what story and characters could be.”\r\n\r\n\r\nWe’re worried about what we might be losing.\r\n\r\n\r\nWhether it’s seeing my family’s breakfast traditions reflected *Shang-Chi and the Legend of the Ten Rings (2021)* or watching *Didi (2024)* and commiserating with friends about growing up in immigrant households, these movies have made us feel seen. It’s not the big flashy moments that resonate with us. \r\n\r\n\r\nWhen I (Dorothy) call my mom while trying to recreate the recipes of my childhood, or realize my Shanghainese is getting rusty because I only speak it with family, it’s easy to feel isolated in the struggle to balance my Chinese and American identities. \r\n\r\n\r\nBut seeing those experiences represented on the big screen serve as a powerful affirmation that I am not alone—and that my experiences deserve to be shared and truly understood.","methodology":"Our initial datasets started with [Luminate](https://luminatedata.com/), a database for music and entertainment data that was previously part of Nielsen Media Research. We used this database to find every film featuring a popular Asian actor since 1981. Luminate Data includes information on actors' background and ethnicities, movies they were in, and details about each movie. \r\n\r\n\r\nUsing the advanced search feature, we compiled a list of actors that satisfied the conditions of: Films, in Development OR Released Films, Genre is Action OR Comedy OR Drama OR Horror OR Sci Fi/Fantasy OR Thriller, Keywords like Asian Lead Cast, Production Status is Completed, Country of Origin(s) United States, Release Type is THEATRICAL, WIDE, do not include Inactive records. We looked at movies that were released from 1981 through 2023. \r\n\r\n\r\nOur initial list returned too broad of a list, because it included actors who were only in films that were not widely distributed. So we filtered the data based on a metric called ScreenScore—a 1-100 scoring system that measures the popularity and relevance of each actor. It considers factors such as how often the actor is searched, the significance of movies they’ve been in, and any awards they’ve received. We talked to a representative at Luminate who helped us determine that a score of 60 was a reasonable cutoff. This left us with 83 actors.\r\n\r\n\r\nWe identified all the movies where these 83 actors were a “Main Title Actor,” meaning they had a significant role in the film. We filtered out movies that had a box office debut of less than $1,000,000 USD, resulting in 371 movies.\r\n\r\n\r\nWhile this methodology was good, we wanted to make sure we didn’t miss any major films. So we added films with Asian actors from the [top-50 highest-grossing films](https://www.boxofficemojo.com/year/2025/) each year, according to IMDB. This gave us **3,582 films**. Of these 2,150 movies, there were 96 movies that ChatGPT classified as having at least one Asian main character that we then added to our list of movies, bringing it to 467 movies. \r\n\r\n\r\nWe then needed to identify the movies that not only had Asian main actors, but also storylines where Asian characters had ethnicities that mattered. While inherently a subjective process, we considered factors such as characters speaking Asian languages, interacting with family, participating in cultural or religious activities, or storylines based in Asian history. We also referenced actor interviews, movie transcripts, online articles, and our best judgement to try and categorize these films. For example, *The Life of Pi (2012)* qualified because the protagonist, Pi, struggles with his Hindu faith and Indian heritage along with other reflections. However, *Jumanji: The Next Level (2019)* did not. While the character Dr. Bravestone is played by Dwayne “The Rock” Johnson, the plot does not reference the character’s Asian identity at all. \r\n\r\n\r\nThis brought our list from 467 to 80 movies—a huge filtering of our list, but it just showed that a huge portion of films had Asian actors but their ethnicity didn’t matter to the plot.\r\n\r\n\r\nOur final dataset included 236 Asian characters in the 80 films played by 165 unique actors. \r\n\r\n\r\nNow came the hard part: We needed to find the ethnicity of the actor and compare that to the ethnicity of characters. We did this by XXXXXX. If an actor had at least a partial ethnicity match with a character they played, we considered that a match. There were 11 characters across six movies who we could not determine a specific ethnicity for a character, so we removed them from our data.\r\n\r\n\r\nImages of actors are used under a Creative Commons license, via Wikimedia, courtesy of the following creators: Sarah E. Freeman/Grady College, Bollywood Hungama, mR.Hom, am730, Ibsan733.0 Production, Casi Moss, Paul Rudman, Gage Skidmore, Wang65, Georges Biard, Crunchydillpickle, Alex Black, Wpcpey, Martin Kraft, DPNews, Dick Thomas Johnson, SliceofchantasticBryan Berlin, Mike Dunn, Romina Espinosa, Wikiwoman555, Cecilia Wang, Nuno Media, Clajabordidar, UK Department for International Development, Collider Video, Elena Ternovaja, Dmarktwb, David Seow, Embassy of the United States in Japan, Sidewalks Entertainment, 티비텐, mysunsun, Carter McKendry, David Shankbone, Robert Scoble, India Ministry of Parliamentary Affairs, Sgt. Jacob Harrer, Netmediatama, Bernard Gotfryd, マイナビニュース, Office of Public Engagement, Super Festivals, Governo do Estado de São Paulo, Nan Palmero, Eric Ishii Eckhardt, レトロワグラース, ch.マイナビニュース【エンタメ・ホビー】, Daniel Benavides, Fedefede99, Georges Biardi, Dominick, India Ministry of Culture, Roger Wo, Jeff Share, Los Angeles Times, Shoebox9114, DXRITA, Molnár VOA Farsi, Zeusprp, Greg2600, Albert Domasin, Siebbi, Gordon Vasquez, BF Distribution, Tabercil, nicolas genin, John Sears, Sean Reynolds, Mingle MediaTV, Pingbook, Rita Molnár, Leah Shang, Jagodens, Logan, Toglenngdc, graphics, Gordon Correll, Gabbo, TMy Sweet Pear Tree, MINT, Meta, Wiz6702, Olivier06400, Gershwiki. Other images were gathered from screenshots of the films themselves."}