{"introScrolly":[{"stage":"1","text":""},{"stage":"2","text":""},{"stage":"3","text":""},{"stage":"4","text":""},{"stage":"5","text":""}],"Headline":"Asian (Mis)Representation","copy1":"Haimei’s reaction to watching Emily in Paris is a sentiment that many Asian Americans have felt—when a character that’s meant to represent them still feels foreign. In fact, just over half of Asian Americans identify most by their specific ethnicity, like “Chinese” or “Thai”, not by the term “Asian”. This highlights to us that in an increasingly diverse Asian American population, accurate castings of these characters matters. So, we set out to examine how often Asians in Hollywood are “miscast,”—where a character of one Asian ethnicity is portrayed by an actor of a different Asian ethnicity—why it matters, and what it looks like to have true representation in Hollywood.","copy2":"The widespread success of recent movies like Crazy Rich Asians (2018) and Everything Everywhere All At Once (2022) marks a new era for Asian cinema. Hollywood’s evolving embrace of Asian representation has brought to the screen not only exciting blockbusters, but has also provided a platform to explore the more complex aspects of Asian identity. This shift aligns with broader trends, as the Asian population in the U.S. has more than doubled since 2000, and, perhaps even more significantly, this population is as diverse as it’s ever been.","tier1scrolly":[{"stage":"6","text":""},{"stage":"7","text":""},{"stage":"8","text":""},{"stage":"9","text":""},{"stage":"10","text":""}],"copy3":"These days, new heights of Asian diversity have brought representation that not only feels more visible, but also more distinct; we’ve portrayed love interests, superheroes, and even the modern-day American family. The past few decades have undoubtedly marked progress in representation of multidimensional Asian main characters, an achievement that deserves recognition.\r\n\r\n\r\nYet, this era of Asian diversity in representation also comes with its own challenges. We no longer settle for generic “Asian” characters—we want authentic actors who have the experiences to bring our culture to life. What’s more, Haimei should be able to decipher her spoken language on screen. Let's explore some other examples of popular media where representation has missed the mark.","example1":"Kim’s Convenience is a show about a Korean-Canadian family that runs a bodega.\r\n* Simu Liu (Chinese) plays Jung (Korean)\r\n* Andrew Phung (Vietnamese-Chinese) plays Kimchee (Korean)","example2":"To All the Boys I’ve Loved Before is a movie franchise featuring a Korean-American lead in a rom-com.\r\n* Lana Condor (Vietnamese) plays; Lara Jean (Korean mixed)\r\n* Janel Parrish (Chinese mixed) plays Margot (Korean mixed)\r\n* Anna Cathcart (Chinese mixed) plays Kitty (Korean mixed)","example3":"Fresh Off the Boat was one of the first sitcom shows to feature an immigrant Chinese-American family. \r\n* Randall Park (Korean) plays Louis (Chinese)","copy4":"All of these popular shows are on major networks, produced with mainstream audiences in mind. They’ve been praised in the media for highlighting the experiences of specific Asian ethnicities, such as Korean American or Chinese American stories. However, even these most financially resourced and successful Asian American shows still faced challenges in casting.\r\n\r\n\r\nThis kind of misrepresentation on screens isn’t just discouraging— it can be damaging. For many people outside of the Asian community, media portrayals may be their only exposure to Asian cultures. When actors of one ethnicity portray characters of a different ethnicity, it inevitably reinforces harmful misconceptions, generalizations, and biases. \r\n\r\n\r\nBut, before we get ahead of ourselves, let’s take a deeper look: Just how often are Asian roles being “miscast”?","copy_datasetup":"","tier2scrolly":[{"stage":"11","text":"We examined 42 years of Asians films where an Asian actor’s ethnicity was relevant to their character, ultimately identifying 71 movies. We then evaluated these movies and categorized if each character was cast accurately. \r\n\r\n\r\nAs we mapped out these films and characters, three distinct eras of Asian representation emerged:"},{"stage":"12","text":"1982-1995\r\nEarly Portrayals\r\nAs late as the 1960s, Hollywood was still using “yellowface,” with white actors exaggerating Asian features, including yellow-toned skin. The 1980s then marked an important breakthrough—though films with Asian leads were still rare, at least they were (mostly) being played by Asian actors.\r\n\r\n\r\nOne defining example was Indiana Jones and the Temple of Doom (1984), which starred child actor Ke Huy Quan alongside some of Hollywood’s biggest names."},{"stage":"13","text":"1996-2009: \r\nRising Stars\r\nThe late 1990s and early 2000s were then pivotal for Asian representation in the US. Movies like Crouching Tiger, Hidden Dragon (2000) brought Asian stories to mainstream audiences, while stars including Michelle Yeoh, Jackie Chan, and Tony Leung Chiu-wai began to build prominent, international careers. For the first time, a surge of Asian stars were driving significant box office success.\r\n\r\n\r\nStill, this representation didn’t always make us proud. Many Asian main characters were still confined to stereotypes, such as being a kung fu master or “oriental” women."},{"stage":"14","text":"2010-2023: \r\nThe 2010s then saw Asian representation expanded into smaller roles and more in-depth characterization. In the past 16 years, the percentage of Asian characters with speaking roles increased from 3.4% to 15.9%, outpacing growth of any other ethnic group in Hollywood.\r\n\r\n\r\nAt the same time, movies starring Asian Americans have started to show a multifaceted portrayal of experiences, going beyond stereotypes and tokenized characters. Recent films like Past Lives (2023), Shang-Chi and the Legend of the Ten Rings (2021), and Joy Ride (2023) have highlighted a diverse set of stories across all genres."},{"stage":"15","text":"The number of Asian movies has certainly grown over these eras, and seeing Asian actors on screen has become more widespread.\r\n\r\n\r\nNow, let’s take a look at how accurately cast these movies were."},{"stage":"16","text":"Out of 71 movies we looked at, 56 were cast with complete accuracy…"},{"stage":"17","text":"…12 movies were cast with partial accuracy…"},{"stage":"18","text":"…and only 3 out of the 71 movies were cast completely inaccurately. \r\n\r\n\r\nThese three films were more obscure—and chances are, you’ve never even heard of them."},{"stage":"19","text":"Looking at a movie level is insightful, and it’s clear that casting accuracy is high. There also weren’t any notable changes in casting accuracy over time, as the inaccurately cast movies span all three eras. \r\n\r\n\r\nBut, as you can tell, some movies have only one Asian main character, while other films have a whole cast of Asian characters. So, now let’s look at accuracy on a character level. Of the 211 Asian main characters, 184—87.2%—were portrayed by actors of the same ethnic background."},{"stage":"20","text":"We also want to consider factors outside of movies and actors that could influence casting. Specifically, do different production studios and directors impact accuracy of casting?"},{"stage":"21","text":"The “Big Five” production studios—Universal, Paramount, Warner Bros., Disney, and Sony—control nearly 85% of the movie market share, yet were behind just 31% of the 71 movies, reflecting a lack of investment in Asian stories.\r\n\r\n\r\nThese movies also cast Asian characters less accurately, with an accuracy rate of 80.9%, a step below the overall rate of 87.2%.\r\n\r\n\r\nStill, “Big Five” movies like Crazy Rich Asians (2018) and Shang-Chi and the Legend of the Ten Rings (2021) have made waves with their representation. With more resources, these large studios have the means to reach mainstream audiences and feature bigger stars."},{"stage":"22","text":"Meanwhile, movies with Asian directors had a 95.5% accuracy rate across 89 main characters. \r\n\r\n\r\nAsian directors have only recently begun to receive more recognition, with Everything Everywhere All At Once (2022) director Daniel Kwan becoming the first Asian director to win the Oscar for Best Director for an Asian-centered film.\r\n\r\n\r\nLooking at the casting from 2020 onward, it’s evident that there have been more Asian directors, and with it, more intentional and accurate casting."},{"stage":"23","text":"So… seems like Hollywood is doing great! There’s more Asian films than ever, and these films are accurately casting Asian actors. \r\n\r\n\r\nWe came into this analysis expecting more miscastings than not, mainly because of the examples that we’ve seen and remembered from our screens. It’s clear that inaccurately cast media, while a small fraction, has had a lasting impact on how we feel represented."}],"conclusion":"These past few years have seen unprecedented support and diversity for Asian Americans on the big screen. While the most overt form of “representation” comes from who is on our screens, true visibility doesn’t end with that. We saw in our data that Asian directors tend to cast more accurately, and large production studios fall short. We need Asian writers, producers, and directors to truly amplify authentic stories. As we explore the balance between exposure of Asian cultures to a wider audience and the building of genuine, resonating Asian storylines, it’s clear that accurate casting is just the start.","methodology":"Our main data source was Luminate Data, a database for music and entertainment data that was previously part of the Nielsen Media Research. Luminate Data includes information on actors' background and ethnicities, movies they were in, and details about each movie. \r\n\r\n\r\nUsing the advanced search feature, we compiled a list of 83 actors that satisfied the conditions of: Films, in Development OR Released Films, Genre is Action OR Comedy OR Drama OR Horror OR Sci Fi/Fantasy OR Thriller, Keywords like Asian Lead Cast, Production Status is Completed, Country of Origin(s) United States, Release Type is THEATRICAL, WIDE, do not include Inactive records. \r\n\r\n\r\nWe then filtered based on the ScreenScore metric, a 1-100 scoring system that considers factors such as popularity of actors in terms of search frequency, significance of movies they’ve been in, and any awards received. We referenced this as a score of how popular and relevant an actor was, and a call with the representative at Luminate helped us determine that a score of 60 was a reasonable cutoff for actor relevancy. Filtering this initial search for only actors with a ScreenScore of 60+ left us with 83 actors. \r\n\r\n\r\nOf the 83 actors, we identified all the movies where they were a Main Title Actor, which we then whittled down to movies that had a box office debut that did at least $1,000,000 USD, resulting in 371 movies (spreadsheet). \r\n\r\n\r\nThen came the hard part: we needed to identify the movies that not only had Asian Main Actors, but also storylines where Asian characters had ethnicities that mattered. While inherently a subjective process, we considered factors such as characters speaking Asian languages, interacting with family, participating in cultural/religious activities, or any storylines based in Asian history. We also referenced actor interviews or other online articles that discussed “accurate” representation of the cultures. This brought our list from 371 to 76 movies (spreadsheet).\r\n\r\n\r\nOur final dataset was all 221 Asian characters (spreadsheet) and Main Title Actors in the 76 films, comparing ethnicity of characters to that of the actors who played them. There were 11 characters across six movies who we could not determine a specific ethnicity for a character, which we removed from the character/actor data. \r\n\r\n\r\nThere are a few limitations to our methods, firstly that we started with a list of prominent Asian actors and the movies they were in. This eliminated movies such as the Joy Luck Club, which is undoubtedly an important movie about the Asian American experience, but did not feature any prominent Asian actors. We chose to only look at movies that had a box office debut, which we determined to be the easiest means of measuring impact and popularity. We did not include any TV shows or streaming. With movies that were determined to have storylines where a character’s ethnicity was relevant, this was an inherently subjective process. We referenced online articles, actor interviews, movie transcripts, and our best judgment to try and categorize these films. \r\n\r\n\r\nA few caveats with the data, we only looked through movies that were released through 2023. We also categorized actors who were more than one ethnicity to be “multiethnic” in our data. If an actor had at least a partial ethnicity match with a character they played, we considered that a match."}