{"comic":[{"stage":"1","text":""},{"stage":"2","text":""},{"stage":"3","text":""},{"stage":"4","text":""},{"stage":"5","text":""},{"stage":"6","text":""}],"history":"For much of US history, Asian American representation in the media was basically nonexistent. In the early 1900s, white actors donning “yellowface” played some of the most prominent Asian characters, including Charlie Chan and Dr. Fu Manchu. Exaggerated ‘racial’ features—including ‘slanted’ eyes, a yellow skin color, black hair, and a mocking ‘Asian’ accent—were common.","population":"But as more Asians migrated to the US, the demand for representation grew louder. From 1980 to 2000, the number of Asian Americans more than tripled, and has only continued to grow.","stereotypes":"On one hand, Asian Americans became more visible in Hollywood. On the other, their characters were often shaped by stereotypes, limiting the depth of their representation. Bruce Lee’s career was largely confined to martial arts roles, while Nancy Kwan, despite her popularity, was repeatedly cast as a ‘Dragon Lady.’","pastDecade":"That started to change in the past decade.\r\n\r\n\r\nThe widespread success of movies like Crazy Rich Asians (2018) and Everything Everywhere All At Once (2022) marked a new era for Asian actors. Asian actors were no longer stereotypes; they were full characters. Hollywood’s evolving embrace of Asian representation brought to the screen not only exciting blockbusters, but also provided a platform to explore the more complex aspects of Asian identity. These days, Asians portray love interests, superheroes, and even the modern-day American family.","identity":"When we watch media about Asian stories, we seek to connect with experiences of our own cultural backgrounds. Part of this means embracing the characters and the actors who portray them. The mere existence and popularity of these movies are, and should be, celebrated as a win for Asian representation. \r\n\r\n\r\nHowever, along with this evolution came experiences like the one Haimei had while watching Emily in Paris—seeing a character meant to represent them, but the character still feels foreign. This is partially because many Asian Americans feel more closely aligned with their specific ethnicity, like “Chinese” or “Thai”, rather than broadly “Asian”.","thesis":"More importantly, Asian Americans have customs, cuisines, and languages that mark our racial identities, and when they aren’t accurately reflected on the big screen, it isn’t just discouraging— it can be damaging. For many people outside of the Asian community, media portrayals may be their only exposure to Asian cultures. When actors of one ethnicity portray characters of a different ethnicity, it inevitably reinforces harmful misconceptions, generalizations, and biases. \r\n\r\n\r\nBut, before we get ahead of ourselves, let’s take a deeper look: just how often are Asian roles being “miscast”?","dataSetup":"We set out to examine how often Asians in Hollywood are “miscast”—where a character of one Asian ethnicity is portrayed by an actor of a different Asian ethnicity— and why it matters. While Haimei's experience was with the TV show Emily in Paris, we wanted to focus on films because they serve as high-stakes cultural milestones that reflect broader shifts in the entertainment industry.\r\n\r\n\r\nWe first scoured Luminate, an entertainment database, to find every popular Asian actor since 1982. We included all the movies they appeared in, regardless of how big a role they played. We also examined the top 200 highest-grossing films from each year in the same time frame.","dataSetup400":"Next, we determined which of these films had Asian actors in a major role, narrowing down our set of movies.","dataSetup80":"From there, we analyzed each film to see if the Asian character’s ethnicity was relevant to their character. For example, The Life of Pi (2012) counted, but Jumanji: The Next Level (2019) did not. We ultimately identified 80 movies that fit our criteria.","tier2scrolly":[{"stage":"7","text":"1982-1995\r\nEarly Portrayals\r\nThrough the late 1960s, Hollywood was still using white actors in “yellowface” to portray Asian people. So the 1980s marked an important breakthrough, when films like Indiana Jones and the Temple of Doom (1984) starred child actor Ke Huy Quan alongside some of Hollywood’s biggest names.\r\n\r\n\r\nThen came The Joy Luck Club (1993), a landmark movie that was the first to feature a majority Asian American cast. The movie follows four Chinese American mothers and daughters, highlighting the complexities of immigration. Asian Americans were excited to see this previously untold perspective, driving the film to earn nearly $33 million at the box office. \r\n\r\n\r\nThis film also helped these Asian actresses find their footing in Hollywood, with Ming-Na Wen, who plays June, describing this movie as being her “green card to Hollywood”. \r\n\r\n\r\nDespite the film’s success, director Wayne Wang struggled to gain momentum in directing more Asian stories, and The Joy Luck Club (1993) was the only movie of its kind for many decades."},{"stage":"8","text":"1996-2009\r\nRising Stars\r\nThe late 1990s and early 2000s were then pivotal for Asian representation in the US. Movies like Crouching Tiger, Hidden Dragon (2000) brought Asian stories to mainstream audiences, while stars including Michelle Yeoh, Jackie Chan, and Tony Leung Chiu-wai began to build prominent, international careers. For the first time, a surge of Asian stars were driving significant box office success.\r\n\r\n\r\nStill, this representation didn’t always make us proud. Many Asian main characters were still confined to stereotypes, such as Jackie Chan being a martial artist in Rush Hour (1998) or the “oriental” women in Memoirs of a Geisha (2005)."},{"stage":"9","text":"2010-2023\r\nThe 2010s then saw Asian representation expanded into smaller roles and more in-depth characterization. In the past 16 years, the percentage of Asian characters with speaking roles increased from 3.4% to 15.9%, outpacing growth of any other ethnic group in Hollywood.\r\n\r\n\r\nAt the same time, movies starring Asian Americans have started to show a multifaceted portrayal of experiences, going beyond stereotypes and tokenized characters. Recent films like Past Lives (2023), Shang-Chi and the Legend of the Ten Rings (2021), and Joy Ride (2023) have highlighted a diverse set of stories across all genres."},{"stage":"10","text":"Asian films also gained recognition at major award shows. Minari (2020) and Everything Everywhere All At Once (2022) were among Asian films honored in Best Picture category at the Oscars in the past few years.\r\n\r\n\r\nEven more indicative of the breakthrough of Asian media into mainstream Hollywood, Parasite (2019)—a Korea produced film featuring an entirely Korean cast speaking Korean—won Best Picture at the Academy Awards. \r\n\r\n\r\nWhile our analysis only focuses on U.S. produced movies, Parasite (2019)’s win is indicative of the increasing recognition of Asian stories in western media."},{"stage":"11","text":"The number of Asian movies has certainly grown over these eras, and seeing Asian actors on screen has become more widespread.\r\n\r\n\r\nBut how accurately cast were these movies?"},{"stage":"12","text":"Out of 80 movies we looked at, 64 were cast with complete accuracy.\r\n\r\n\r\nTo be honest, this was a much higher portion than we’d anticipated. Our initial research and conversations had led us to popular pieces of media such as To All the Boys I’ve Loved Before and Fresh Off the Boat, where miscastings were apparent. So, we’d really approached this data ready to blame Hollywood."},{"stage":"13","text":"Meanwhile, 13 movies were cast with partial accuracy."},{"stage":"14","text":"And only 3 out of the 80 movies were cast completely inaccurately. \r\n\r\n\r\nThese three films were more obscure—and chances are, you’ve never even heard of them, like Missing in Action (1984) or A Hologram for the King (2016)."},{"stage":"15","text":"All in all, of the 236 Asian main characters, 208—88%—were portrayed by actors of the same ethnic background.\r\n\r\n\r\nIt’s not an Asian actor’s fault that they are playing a character of a different ethnicity. In the past, being Asian greatly limited the types of roles available in Hollywood, so actors had to take what was available to them in a white-centric industry."},{"stage":"16","text":"There were some factors that influenced accurate—and inaccurate—casting. Specifically, do different production studios and directors impact accuracy of casting?"},{"stage":"17","text":"The “Big Five” production studios—Universal, Paramount, Warner Bros., Disney, and Sony—control nearly 85% of the movie market share, yet were behind just 39% of the 80 movies, reflecting a lack of investment in Asian stories.\r\n\r\n\r\nStill, “Big Five” movies like Crazy Rich Asians (2018) and Shang-Chi and the Legend of the Ten Rings (2021) made waves with their representation. With more resources, these large studios have the means to reach mainstream audiences and feature bigger stars.\r\n\r\n\r\nIt’s also worth noting that of the Asian movies that these studios did invest in, casting accuracy was on par with other movies, with accuracy of 86%."},{"stage":"18","text":"*Meanwhile, movies with Asian directors had a 94% accuracy rate across 101 main characters. \r\n\r\n\r\nAsian directors have directed more Asian movies compared to the past, and this has reached an all-time high in recent years. It’s clear that when Asian filmmakers get to lead these stories, casting is done with more intentionality and accuracy.\r\n\r\n\r\nAsians directors have also recently begun receiving more recognition, with Everything Everywhere All At Once (2022) director Daniel Kwan becoming the first Asian director to win the Oscar for Best Director for an Asian-led film.\r\n\r\n\r\nThis recognition sends a powerful message that Asian directors create movies that generate box office revenue and garner international acclaim. Hopefully, this continues to pave the way for Asian directors to take on high-profile projects."},{"stage":"19","text":"So… seems like Hollywood is doing great! There’s more Asian films than ever, and these films are accurately casting Asian actors."}],"conclusion":"At every step in history, Asians have had to fight for the representation we’ve wanted to see. It’s easy to forget that just 60 years ago, Anna May Wong lost out on roles to white actors in “yellowface” —a practice that only began to fade during the civil rights movement. And, just 20 years ago, representation still only consisted of stereotypes, evident through all the action movies with oriental villains that we sorted through. How far Asian American representation has come is a reflection of those who came before, and this is a privilege we do not take lightly. \r\n\r\n\r\nIt’s important that we celebrate the representation we currently see, yet also understand that this is not the full picture. In 2024, racial and gender diversity in Hollywood decreased for the first time in many years, a disappointing but unsurprising result in this current socio-political climate. A study published in 2025 showed that less than 30% of APIs feel like they are represented in the media. So, how do we bridge this disconnect of being represented on screen versus actually feeling represented? We have to understand that while the most overt form of “representation” comes from who is on our screens, true visibility doesn’t end with that. We saw in our data that Asian directors tend to cast more accurately, and large production studios fall short in how much they invest in Asian stories. We need Asian writers, producers, and directors to tell Asian American stories. \r\n\r\n\r\nWe came into this analysis expecting more miscastings than not, mainly because of the examples that we’ve seen and remembered from our screens. It’s clear that inaccurately cast media, while a small fraction, has had a lasting impact on how we feel represented. \r\n\r\n\r\nBut, we also remember the media that made us feel seen. (Rest of conclusion still work in progress.)","methodology":"Our main data source was Luminate Data, a database for music and entertainment data that was previously part of the Nielsen Media Research. Luminate Data includes information on actors' background and ethnicities, movies they were in, and details about each movie. \r\n\r\n\r\nUsing the advanced search feature, we compiled a list of 83 actors that satisfied the conditions of: Films, in Development OR Released Films, Genre is Action OR Comedy OR Drama OR Horror OR Sci Fi/Fantasy OR Thriller, Keywords like Asian Lead Cast, Production Status is Completed, Country of Origin(s) United States, Release Type is THEATRICAL, WIDE, do not include Inactive records. \r\n\r\n\r\nWe then filtered based on the ScreenScore metric, a 1-100 scoring system that considers factors such as popularity of actors in terms of search frequency, significance of movies they’ve been in, and any awards received. We referenced this as a score of how popular and relevant an actor was, and a call with the representative at Luminate helped us determine that a score of 60 was a reasonable cutoff for actor relevancy. Filtering this initial search for only actors with a ScreenScore of 60+ left us with 83 actors. \r\n\r\n\r\nOf the 83 actors, we identified all the movies where they were a Main Title Actor, which we then whittled down to movies that had a box office debut that did at least $1,000,000 USD, resulting in 371 movies (spreadsheet). \r\n\r\n\r\nThen came the hard part: we needed to identify the movies that not only had Asian Main Actors, but also storylines where Asian characters had ethnicities that mattered. While inherently a subjective process, we considered factors such as characters speaking Asian languages, interacting with family, participating in cultural/religious activities, or any storylines based in Asian history. We also referenced actor interviews or other online articles that discussed “accurate” representation of the cultures. This brought our list from 371 to 76 movies (spreadsheet).\r\n\r\n\r\nOur final dataset was all 221 Asian characters (spreadsheet) and Main Title Actors in the 76 films, comparing ethnicity of characters to that of the actors who played them. There were 11 characters across six movies who we could not determine a specific ethnicity for a character, which we removed from the character/actor data. \r\n\r\n\r\nThere are a few limitations to our methods, firstly that we started with a list of prominent Asian actors and the movies they were in. This eliminated movies such as the Joy Luck Club, which is undoubtedly an important movie about the Asian American experience, but did not feature any prominent Asian actors. We chose to only look at movies that had a box office debut, which we determined to be the easiest means of measuring impact and popularity. We did not include any TV shows or streaming. With movies that were determined to have storylines where a character’s ethnicity was relevant, this was an inherently subjective process. We referenced online articles, actor interviews, movie transcripts, and our best judgment to try and categorize these films. \r\n\r\n\r\nA few caveats with the data, we only looked through movies that were released through 2023. We also categorized actors who were more than one ethnicity to be “multiethnic” in our data. If an actor had at least a partial ethnicity match with a character they played, we considered that a match."}