{"1":[],"2":[],"introScrolly":[{"stage":"1","text":"My mother, Haimei, is a strong first generation immigrant from a small fishing village in China. She’s worked her whole life to build a wonderful life in New York City, and after her two children have grown up and moved out, all she really wants to do is settle into her comfortable white couch, cuddle with her small chihuahua Tom, and watch TV."},{"stage":"2","text":"It’s 10:12pm and she just came back from a long day of cleaning clothes at the laundromat she runs with her husband. She browses Netflix for a bit, and after a bit of scrolling, settles on watching Emily in Paris -- after all, she’s always had a not-so-secret obsession with the idea of living in France herself. It’s a bit of a pipe dream, but for tonight, maybe she can be Haimei in Paris."},{"stage":"3","text":"She’s on episode 2, and Mindy Chen is introduced— wow! Mindy was also born and raised in China, and Haimei sees her youthful energy being mirrored back at her. Ever since I was a child, I was obsessed with the idea of living in Paris, Mindy says. Haimei decides she likes her."},{"stage":"4","text":"Something’s off, though. She watches a scene where Mindy's conversing with her father in Mandarin, but her pronunciation and cadence are strained; she’s clearly not that of a fluent speaker. Another scene shows her singing on a Chinese pop show, but everything’s a little off -- not only her singing, but also her mannerisms. It bothers Haimei, knowing how inaccurate everything is."},{"stage":"5","text":"Haimei does a quick Google search and confirms her doubts: Mindy is played by Ashley Park, a Korean-American woman. It makes her sad— do these casting directors think Korean and Chinese actors are interchangeable? Haimei loves Mindy as a character, but the way she’s being portrayed leaves a bad taste in her mouth."}],"headline":"“ASIAN” REPRESENTATION","copy1":"For much of US history, Asian American representation was basically nonexistent. Starting in the 1900s, white actors played some of the most prominent Asian characters throughout films, including Charlie Chan and Dr. Fu Manchu. The “Yellowface” practices of the early 1900s were centered around white actors playing up ‘racial’ features, including ‘slanted’ eyes, a yellow skin color, black hair, and a mocking ‘Asian’ accent. \r\n\r\n\r\nOnce Asian Americans did get to play themselves on screen, writers made their characters based on stereotypes, inhibiting depth of representation; Bruce Lee’s career was limited to portraying a martial arts master and despite Anna May Wong’s popularity, her castings were always that of a ‘Dragon Lady’.","copy2":"These days, movies like Crazy Rich Asians and Everything Everywhere All At Once have garnered support not only throughout the Asian American community, but have also received critical international acclaim. This growing popularity is reflected in our data, which centers on 371 movies starring Asians as main cast, produced between 1981 and 2023.","tier1scrolly":[{"stage":"6","text":"The number of movies featuring Asian main cast has steadily increased since the 1980s. In the past 16 years alone, the percentage of Asian characters with speaking roles increased from 3.4% to 15.9%, outpacing growth of any other ethnic group in Hollywood."},{"stage":"7","text":"The early 2000s were pivotal years for Asian representation in the US. Movies like Crouching Tiger, Hidden Dragon (2000) brought Asian stories to mainstream audiences; stars including Michelle Yeoh, Jackie Chan, and Tony Leung Chiu-wai began to build prominent, international careers. For the first time, a surge of Asian stars were driving significant box office success. The momentum carried into the 2010s, as the new generation of Asian actors have achieved even more diversity and recognition."},{"stage":"8","text":"It’s no surprise, then, that the past few decades have also seen significant growth for the Asian population in the US, which has increased by 81% over the past two decades[1]. Movies starring Asian Americans have started to encompass a multifaceted portrayal of their experience, going beyond stereotypes and tokenized characters. Recent films like Past Lives, Shang-Chi and the Legend of the Ten Rings, and Joy Ride have highlighted a diverse set of stories across all genres. As Asian Americans ourselves, this is really exciting to see!"},{"stage":"9","text":""},{"stage":"10","text":""}],"copy3":"But what does “Asian American” even mean? The government recognizes “Asian American” as an official term used in the United States census, and many people identify Asians as a monolith based on the ideas that they “look similar” and have similar backgrounds. However, more than half of Asian Americans identify most by their specific ethnicity, like “Chinese” or “Thai”, not by the term “Asian”.[2] \r\n\r\n\r\nIncreased representation of Asian American stories is undoubtedly a win, but what stood out to us was how this representation can homogenize the nuanced experiences of different ethnicities. Haimei’s reaction to watching Emily in Paris is a sentiment that many Asian Americans have felt when a character meant to represent them doesn't quite resonate. Let’s look at some other examples:","example1":"Kim’s Convenience is a show about a Korean-Canadian family that runs a bodega.\r\n* Simu Liu (Chinese) plays Jung (Korean)\r\n* Andrew Phung (Vietnamese-Chinese) plays Kimchee (Korean)","example2":"To All the Boys I’ve Loved Before is a movie franchise featuring a Korean-American lead in a rom-com.\r\n* Lana Condor (Vietnamese) plays; Lara Jean (Korean mixed)\r\n* Janel Parrish (Chinese mixed) plays Margot (Korean mixed)\r\n* Anna Cathcart (Chinese mixed) plays Kitty (Korean mixed)","example3":"Fresh Off the Boat was one of the first sitcom shows to feature an immigrant Chinese-American family. \r\n* Randall Park (Korean) plays Louis (Chinese)","copy4":"Inaccurate representation isn’t just just discouraging— it’s damaging. For many, media portrayals are a main source of exposure to Asian cultures. If their portrayals are filled with stereotypes and inaccuracies, they will inevitably lead to the reinforcement of harmful misconceptions, generalizations and biases. When Hollywood substitutes Asian actors to play other Asian characters, this not only impacts the opportunities of who gets to represent their own culture, but also how Asian cultures are received by the audience.\r\n\r\n\r\nIt’s important to note that ‘accurate’ representation has nothing to do with actors looking a certain ethnicity of Asian. In fact, this stereotype is exactly what we’re trying to dispute: there is no certain look for a specific ethnicity. Rather, nuance in cultural elements such as language, religion, foods, and social customs impact how Asian ethnicities vary.","copy_datasetup":"So, we decided to see how common it was for Asian characters to be portrayed by Asian actors of the same ethnicity. Being accurately cast isn’t all it takes to represent a culture respectfully, but we consider it a baseline step in authentic character portrayal. Our analysis began with 83 popular Asian actors, the 371 popular movies in which they played main characters, and ultimately centered on 76 of those films where we believed the actors' ethnicities and cultures were invaluable to the storyline.","tier2scrolly":[{"stage":"11","text":"0. Neutral boxes. Explain setup of viz"},{"stage":"12","text":"1. 100% accurate -- gray for all other ones, ‘green’ for accurate"},{"stage":"13","text":"2. Mixed accuracy -- opaque gray for all the rest, opaque green for 100% accurate, full opacity for mixed accuracy"},{"stage":"14","text":"3. 0% accuracy -- opaque greens/reds for everything else, 100% opacity for highlighted"},{"stage":"15","text":"4. Show everything at 100% opacity"},{"stage":"16","text":"5. Highlight first couple years of nothing (1982-1995), the rest is transparent"},{"stage":"17","text":"6. Highlight first couple years of booming (1996-2010), the rest is transparent"},{"stage":"18","text":"7. Highlight first couple years of booming (2010-2023), the rest is transparent"},{"stage":"19","text":"8. Big 5 -- make non big 5 transparent"},{"stage":"20","text":"9. Asian directors -- make non asian directors transparent"},{"stage":"21","text":"10. Back to complete viz, can hover theoretically and stuff (full functionality/explore)"}],"conclusion":"Asian representation in Hollywood has continued to expand, and more than 80% of these movies with prominent Asian storylines are accurately cast. We were pleasantly surprised!\r\n\r\n\r\nWhen we watch media about Asian stories, we seek to connect with experiences of our own cultural backgrounds. Part of this means embracing the characters and the actors who portray them. The mere existence and popularity of these movies are, and should be, celebrated as a win for Asian representation. \r\n\r\n\r\nWe came into this project expecting more miscastings than not, mainly because of the examples that we’ve seen and remembered from our screens. It’s clear that inaccurately cast media, while a small fraction, has had a lasting impact on how we feel represented. \r\n\r\n\r\nThese past few years have seen unprecedented support and diversity for Asian Americans on the big screen. While the most overt form of “representation” comes from who is on our screens, true visibility doesn’t end with that. We saw in our data that Asian directors tend to cast more accurately, and large production studios fall short. We need Asian writers, producers, and directors to truly amplify authentic stories. As we explore the balance between exposure of Asian cultures to a wider audience and the building of genuine, resonating Asian storylines, it’s clear that accurate casting is just the start.","methodology":"Our main data source was Luminate Data, a database for music and entertainment data that was previously part of the Nielsen Media Research. Luminate Data includes information on actors' background and ethnicities, movies they were in, and details about each movie. \r\n\r\n\r\nUsing the advanced search feature, we compiled a list of 83 actors that satisfied the conditions of: Films, in Development OR Released Films, Genre is Action OR Comedy OR Drama OR Horror OR Sci Fi/Fantasy OR Thriller, Keywords like Asian Lead Cast, Production Status is Completed, Country of Origin(s) United States, Release Type is THEATRICAL, WIDE, do not include Inactive records. \r\n\r\n\r\nWe then filtered based on the ScreenScore metric, a 1-100 scoring system that considers factors such as popularity of actors in terms of search frequency, significance of movies they’ve been in, and any awards received. We referenced this as a score of how popular and relevant an actor was, and a call with the representative at Luminate helped us determine that a score of 60 was a reasonable cutoff for actor relevancy. Filtering this initial search for only actors with a ScreenScore of 60+ left us with 83 actors. \r\n\r\n\r\nOf the 83 actors, we identified all the movies where they were a Main Title Actor, which we then whittled down to movies that had a box office debut that did at least $1,000,000 USD, resulting in 371 movies (spreadsheet). \r\n\r\n\r\nThen came the hard part: we needed to identify the movies that not only had Asian Main Actors, but also storylines where Asian characters had ethnicities that mattered. While inherently a subjective process, we considered factors such as characters speaking Asian languages, interacting with family, participating in cultural/religious activities, or any storylines based in Asian history. We also referenced actor interviews or other online articles that discussed “accurate” representation of the cultures. This brought our list from 371 to 76 movies (spreadsheet).\r\n\r\n\r\nOur final dataset was all 221 Asian characters (spreadsheet) and Main Title Actors in the 76 films, comparing ethnicity of characters to that of the actors who played them. There were 11 characters across six movies who we could not determine a specific ethnicity for a character, which we removed from the character/actor data. \r\n\r\n\r\nThere are a few limitations to our methods, firstly that we started with a list of prominent Asian actors and the movies they were in. This eliminated movies such as the Joy Luck Club, which is undoubtedly an important movie about the Asian American experience, but did not feature any prominent Asian actors. We chose to only look at movies that had a box office debut, which we determined to be the easiest means of measuring impact and popularity. We did not include any TV shows or streaming. With movies that were determined to have storylines where a character’s ethnicity was relevant, this was an inherently subjective process. We referenced online articles, actor interviews, movie transcripts, and our best judgment to try and categorize these films. \r\n\r\n\r\nA few caveats with the data, we only looked through movies that were released through 2023. We also categorized actors who were more than one ethnicity to be “multiethnic” in our data. If an actor had at least a partial ethnicity match with a character they played, we considered that a match."}