{"history":"For much of US history, Asian American representation in the media was basically nonexistent. The early 1900s saw white actors donning <a href=\"https://www.history.com/news/yellowface-whitewashing-in-film-america\">“yellowface”</a> to play some of the most prominent Asian characters, including Charlie Chan and Dr. Fu Manchu. Exaggerated ‘racial’ features—including ‘slanted’ eyes, a yellow skin color, black hair, and a mocking ‘Asian’ accent—were common.","population":"However, much has changed since then. The Asian population experienced some growth throughout the 1900s, but it wasn’t until the passage of <a href=\"https://www.loc.gov/classroom-materials/immigration/chinese/a-new-community/”>the Immigration and Nationality Act of 1965</a>when Asian migration drastically accelerated. With this, demand for representation grew louder.","stereotypes":"Asian Americans became more visible in Hollywood, but their roles were often shaped by stereotypes, limiting the depth of their representation. Bruce Lee’s career was largely confined to martial arts roles, while Nancy Kwan, despite her popularity, was repeatedly cast as a ‘Dragon Lady.’","dataTransition":"From the 1970s to the 1990s, the Asian American population increased nearly fivefold. We started to see films that starred Asian actors—and American films that celebrated Asian American culture. These Hollywood productions didn’t just increase visibility of Asians, they also represented broader shifts in our culture.\r\n\r\n\r\nBut just because Asian actors are in a film doesn’t mean our cultures are actually being represented in a meaningful way. So, to explore this further we compiled more than 3,500 films from the 1980s-2020s with Asian actors. We found that less than 500 of those films had Asian actors in a major role. From there, we filtered the list down to films where the character’s Asian ethnicity was an important part of the storyline—and that winnowed the list to <strong>80 films</strong>, with <strong>140 Asian actors</strong> playing <strong>2356 characters</strong>.","dataSetup":"We started with <a href=\"https://luminatedata.com/\">Luminate</a>, an entertainment industry database, to find every film featuring a popular Asian actor. We also looked at the top 50 highest-grossing films from each year with Asian actors. This gave us <strong>3,582 films</strong>. Determining which films had Asian actors in major roles reduced our list to <strong>477 films</strong>. \r\n\r\n\r\nWe then analyzed each film to see if the Asian character’s ethnicity was relevant to their character. For example, <em>The Life of Pi (2012)</em> qualifies because the protagonist, Pi, struggles with his Hindu faith and Indian heritage along with other reflections. However, <em>Jumanji: The Next Level (2019)</em> did not. While the character Dr. Bravestone is played by Dwayne “The Rock” Johnson, the plot does not reference the character’s Asian identity at all.","pastDecade":"These days, Asian actors no longer play just stereotypes; they are full characters—love interests, superheroes, and even the modern-day American family. \r\n\r\n\r\nThis new era for Asian representation has been further cemented by the widespread success of movies like  <em>Crazy Rich Asians (2018)</em>, <em>Minari (2020)</em>, and <em>Everything Everywhere All At Once (2022)</em>.","identity":"Asian Americans, like Haimei, are now more likely to see their own cultural backgrounds reflected in film, and these distinctions in culture matter.\r\nAccording to a <a href=\"https://www.pewresearch.org/race-and-ethnicity/2023/05/08/diverse-cultures-and-shared-experiences-shape-asian-american-identities/\">2023 poll by the Pew Research Center</a>, many Asian Americans feel more closely aligned with their specific ethnicity, like “Chinese” or “Thai”, rather than broadly “Asian”. That’s why it’s especially exciting to see our specific customs, cuisines, and languages reflected on the big screen.","thesis":"Conversely, seeing our cultures inaccurately represented can be incredibly uncomfortable and off-putting. Whether it be because they’re played by an actor of a different ethnicity or embodying inaccurate stereotypes, it just doesn’t feel quite right. Not only do these characters fail to represent who we are; they can reinforce harmful misconceptions, generalizations, and biases. They send the message that Hollywood—and America as a whole—still sees Asians as one big monolith. \r\n\r\n\r\nBut before we get ahead of ourselves, how common is it for Asian characters to be played by an actor of a different ethnicity?","conclusion":"","methodology":"Our main data source was Luminate Data, a database for music and entertainment data that was previously part of the Nielsen Media Research. Luminate Data includes information on actors' background and ethnicities, movies they were in, and details about each movie. \r\n\r\n\r\nUsing the advanced search feature, we compiled a list of actors that satisfied the conditions of: Films, in Development OR Released Films, Genre is Action OR Comedy OR Drama OR Horror OR Sci Fi/Fantasy OR Thriller, Keywords like Asian Lead Cast, Production Status is Completed, Country of Origin(s) United States, Release Type is THEATRICAL, WIDE, do not include Inactive records. \r\n\r\n\r\nWe then filtered based on the ScreenScore metric, a 1-100 scoring system that considers factors such as popularity of actors in terms of search frequency, significance of movies they’ve been in, and any awards received. We referenced this as a score of how popular and relevant an actor was, and a call with the representative at Luminate helped us determine that a score of 60 was a reasonable cutoff for actor relevancy. Filtering this initial search for only actors with a ScreenScore of 60+ left us with 83 actors. \r\n\r\n\r\nOf the 83 actors, we identified all the movies where they were a Main Title Actor, which we then whittled down to movies that had a box office debut that did at least $1,000,000 USD, resulting in 371 movies (spreadsheet). \r\n\r\n\r\nThen came the hard part: we needed to identify the movies that not only had Asian Main Actors, but also storylines where Asian characters had ethnicities that mattered. While inherently a subjective process, we considered factors such as characters speaking Asian languages, interacting with family, participating in cultural/religious activities, or any storylines based in Asian history. We also referenced actor interviews or other online articles that discussed “accurate” representation of the cultures. This brought our list from 371 to 76 movies (spreadsheet).\r\n\r\n\r\nOur final dataset was all 221 Asian characters (spreadsheet) and Main Title Actors in the 76 films, comparing ethnicity of characters to that of the actors who played them. There were 11 characters across six movies who we could not determine a specific ethnicity for a character, which we removed from the character/actor data. \r\n\r\n\r\nThere are a few limitations to our methods, firstly that we started with a list of prominent Asian actors and the movies they were in. This eliminated movies such as the Joy Luck Club, which is undoubtedly an important movie about the Asian American experience, but did not feature any prominent Asian actors. We chose to only look at movies that had a box office debut, which we determined to be the easiest means of measuring impact and popularity. We did not include any TV shows or streaming. With movies that were determined to have storylines where a character’s ethnicity was relevant, this was an inherently subjective process. We referenced online articles, actor interviews, movie transcripts, and our best judgment to try and categorize these films. \r\n\r\n\r\nA few caveats with the data, we only looked through movies that were released through 2023. We also categorized actors who were more than one ethnicity to be “multiethnic” in our data. If an actor had at least a partial ethnicity match with a character they played, we considered that a match."}