{"history":"For much of US history, Asian American representation in the media was basically nonexistent. The early 1900s saw white actors donning <a href=\"https://www.history.com/news/yellowface-whitewashing-in-film-america\">“yellowface”</a> to play some of the most prominent Asian characters, including Charlie Chan and Dr. Fu Manchu. Exaggerated ‘racial’ features—including ‘slanted’ eyes, a yellow skin color, black hair, and a mocking ‘Asian’ accent—were common.","population":"However, as Asian migration to the US <a href=\"https://www.migrationpolicy.org/article/asian-immigrants-united-states-2014#:~:text=The%20number%20of%20Asian%20immigrants,the%20nation's%2042.4%20million%20immigrants\">ramped up in the 1960s</a>, the demand for representation grew louder.","stereotypes":"On one hand, Asian Americans became more visible in Hollywood. On the other, their characters were often shaped by stereotypes, limiting the depth of their representation. Bruce Lee’s career was largely confined to martial arts roles, while Nancy Kwan, despite her popularity, was repeatedly cast as a ‘Dragon Lady.’","pastDecade":"The widespread success of movies like <em>Crazy Rich Asians (2018)</em>, <em>Minari (2020)</em>, and <em>Everything Everywhere All At Once (2022)</em> marked a new era for Asian actors, gaining recognition at major award shows.","identity":"Even more indicative of the breakthrough of Asian media into mainstream Hollywood, Parasite (2019)—a Korea produced film featuring an entirely Korean cast speaking Korean—won Best Picture at the Academy Awards.  (Our analysis only focuses on U.S. produced movies, so Parasite isn’t in our data.)\r\n\r\n\r\nAsian actors were no longer stereotypes; they were full characters—love interests, superheroes, and even the modern-day American family.\r\n\r\n\r\nAsian Americans, like Haimei, were more likely to see their own cultural backgrounds reflected in films. And we got excited about seeing our customs, cuisines, and languages reflected on the big screen. We knew that, for many people, these media portrayals may be their only exposure to our cultures. This was especially important for many Asians in the US because, according to a <a href=\"https://www.pewresearch.org/race-and-ethnicity/2023/05/08/diverse-cultures-and-shared-experiences-shape-asian-american-identities/\">2023 poll by the Pew Research Center</a>, many Asian Americans feel more closely aligned with their specific ethnicity, like “Chinese” or “Thai”, rather than broadly “Asian”.","thesis":"But every once in a while, we had experiences like the one Haimei had while watching Emily in Paris—seeing a character meant to represent us still feels foreign. Whether it be because they’re played by an actor of a different ethnicity or embodying inaccurate stereotypes, it just doesn’t feel quite right. This isn’t just discouraging—it can be damaging. Not only do these characters fail to represent who we are; they reinforce harmful misconceptions, generalizations, and biases. They send the message that Hollywood still sees Asians as one big monolith. \r\n\r\n\r\nSo how common is it for Asian characters to be played by an actor of a different ethnicity?","dataTransition":"From the 1970s to the 1990s, the Asian American population increased nearly fivefold. We started to see films that starred Asian actors—and American films that celebrated Asian American culture. This was especially important because Hollywood productions can represent high-stakes milestones that reflect broader shifts in our culture.\r\n\r\n\r\nBut we were particularly interested in whether Asian actors were cast in major roles where the ethnicity of the character was relevant. This would help us filter out characters who are generalized Asian stereotypes and instead identify characters who we believe embody Asian narratives.","dataSetup":"<ul>\r\n<li>We started with <a href=\"https://luminatedata.com/\">Luminate</a>, an industry database of actors and media, to find these popular Asian actors. We then made a list of every film these actors appeared in since 1982, regardless of how big a role they played. We also scoured the top 50 highest-grossing films from each year to look for Asian actors. This gave us <strong>3,582 films</strong>.</li>\r\n<li>We only wanted films where Asian actors played a major role, which gave us 477 films.</li>\r\n<li>Finally, we analyzed each film to see if the Asian character’s ethnicity was relevant to their character. For example, <em>The Life of Pi (2012)</em> qualifies because the protagonist, Pi, grapples with his Hindu faith and Indian heritage along with other cultural and religious reflections. However, Jumanji: The Next Level (2019) did not. While Dr. Bravestone is portrayed by Dwayne \"The Rock\" Johnson, the plot does not reference the character’s Asian identity at all. </li>\r\n</ul>\r\n\r\n\r\nWe ultimately identified 80 films that fit our criteria, with 140 Asian actors playing 236 characters. Not a huge number, but it just goes to show how rare Asian roles and Asian stories have been in Hollywood. Let's take a look at these 80 movies and where they fall within the past few decades of Hollywood:","tier2scrolly":[{"stage":"7","text":"1982-1995\r\nEarly Portrayals\r\nThrough the late 1960s, Hollywood was still using white actors in “yellowface” to portray Asian people. So the 1980s marked an important breakthrough, when films like Indiana Jones and the Temple of Doom (1984) starred child actor Ke Huy Quan alongside some of Hollywood’s biggest names.\r\n\r\n\r\nThen came The Joy Luck Club (1993), a landmark movie that was the first to feature a majority Asian American cast. The movie follows four Chinese American mothers and daughters, highlighting the complexities of immigration. Asian Americans were excited to see this previously untold perspective, driving the film to earn nearly $33 million at the box office. \r\n\r\n\r\nThis film also helped these Asian actresses find their footing in Hollywood, with Ming-Na Wen, who plays June, describing this movie as being her “green card to Hollywood”. \r\n\r\n\r\nDespite the film’s success, director Wayne Wang struggled to gain momentum in directing more Asian stories, and The Joy Luck Club (1993) was the only movie of its kind for many decades."},{"stage":"8","text":"1996-2009\r\nRising Stars\r\nThe late 1990s and early 2000s were then pivotal for Asian representation in the US. Movies like Crouching Tiger, Hidden Dragon (2000) brought Asian stories to mainstream audiences, while stars including Michelle Yeoh, Jackie Chan, and Tony Leung Chiu-wai began to build prominent, international careers. For the first time, a surge of Asian stars were driving significant box office success.\r\n\r\n\r\nStill, this representation didn’t always make us proud. Many Asian main characters were still confined to stereotypes, such as Jackie Chan being a martial artist in Rush Hour (1998) or the “oriental” women in Memoirs of a Geisha (2005)."},{"stage":"9","text":"2010-2023\r\nThe 2010s then saw Asian representation expanded into smaller roles and more in-depth characterization. In the past 16 years, the percentage of Asian characters with speaking roles increased from 3.4% to 15.9%, outpacing growth of any other ethnic group in Hollywood.\r\n\r\n\r\nAt the same time, movies starring Asian Americans have started to show a multifaceted portrayal of experiences, going beyond stereotypes and tokenized characters. Recent films like Past Lives (2023), Shang-Chi and the Legend of the Ten Rings (2021), and Joy Ride (2023) have highlighted a diverse set of stories across all genres."},{"stage":"10","text":"Asian films also gained recognition at major award shows. Minari (2020) and Everything Everywhere All At Once (2022) were among Asian films honored in Best Picture category at the Oscars in the past few years.\r\n\r\n\r\nEven more indicative of the breakthrough of Asian media into mainstream Hollywood, Parasite (2019)—a Korea produced film featuring an entirely Korean cast speaking Korean—won Best Picture at the Academy Awards. \r\n\r\n\r\nWhile our analysis only focuses on U.S. produced movies, Parasite (2019)’s win is indicative of the increasing recognition of Asian stories in western media."},{"stage":"11","text":"The number of Asian movies has certainly grown over these eras, and seeing Asian actors on screen has become more widespread.\r\n\r\n\r\nBut how accurately cast were these movies?"},{"stage":"12","text":"Out of 80 movies we looked at, 64 were cast with complete accuracy.\r\n\r\n\r\nTo be honest, this was a much higher portion than we’d anticipated. Our initial research and conversations had led us to popular pieces of media such as To All the Boys I’ve Loved Before and Fresh Off the Boat, where miscastings were apparent. So, we’d really approached this data ready to blame Hollywood."},{"stage":"13","text":"Meanwhile, 13 movies were cast with partial accuracy."},{"stage":"14","text":"And only 3 out of the 80 movies were cast completely inaccurately. \r\n\r\n\r\nThese three films were more obscure—and chances are, you’ve never even heard of them, like Missing in Action (1984) or A Hologram for the King (2016)."},{"stage":"15","text":"All in all, of the 236 Asian main characters, 208—88%—were portrayed by actors of the same ethnic background.\r\n\r\n\r\nIt’s not an Asian actor’s fault that they are playing a character of a different ethnicity. In the past, being Asian greatly limited the types of roles available in Hollywood, so actors had to take what was available to them in a white-centric industry."},{"stage":"16","text":"There were some factors that influenced accurate—and inaccurate—casting. Specifically, do different production studios and directors impact accuracy of casting?"},{"stage":"17","text":"The “Big Five” production studios—Universal, Paramount, Warner Bros., Disney, and Sony—control nearly 85% of the movie market share, yet were behind just 39% of the 80 movies, reflecting a lack of investment in Asian stories.\r\n\r\n\r\nStill, “Big Five” movies like Crazy Rich Asians (2018) and Shang-Chi and the Legend of the Ten Rings (2021) made waves with their representation. With more resources, these large studios have the means to reach mainstream audiences and feature bigger stars.\r\n\r\n\r\nIt’s also worth noting that of the Asian movies that these studios did invest in, casting accuracy was on par with other movies, with accuracy of 86%."},{"stage":"18","text":"*Meanwhile, movies with Asian directors had a 94% accuracy rate across 101 main characters. \r\n\r\n\r\nAsian directors have directed more Asian movies compared to the past, and this has reached an all-time high in recent years. It’s clear that when Asian filmmakers get to lead these stories, casting is done with more intentionality and accuracy.\r\n\r\n\r\nAsians directors have also recently begun receiving more recognition, with Everything Everywhere All At Once (2022) director Daniel Kwan becoming the first Asian director to win the Oscar for Best Director for an Asian-led film.\r\n\r\n\r\nThis recognition sends a powerful message that Asian directors create movies that generate box office revenue and garner international acclaim. Hopefully, this continues to pave the way for Asian directors to take on high-profile projects."},{"stage":"19","text":"So… seems like Hollywood is doing great! There’s more Asian films than ever, and these films are accurately casting Asian actors."}],"conclusion":"We came into this project expecting more miscastings than not. Both of us had disheartening recollections of watching miscast characters in popular media, so to see most films accurately cast was surprising.\r\n\r\n\r\nBut it also reminded us that inaccurately cast media had a lasting impact on Asian Americans’ impressions of the world around us. A <a href=\"https://www.mckinsey.com/featured-insights/diversity-and-inclusion/from-margins-to-mainstream-asians-and-pacific-islanders-in-hollywood\">study published in 2025 </a> showed that less than 30% of APIs feel like they are represented in the media.\r\n\r\n\r\nPerhaps it’s because, just 60 years ago, Anna May Wong lost out on roles to white actors in “yellowface”—a practice that only began to fade during the civil rights movement. And, just 20 years ago, representation still only consisted of stereotypes, evident through all the action movies with oriental villains that we sorted through.\r\n\r\n\r\nWe also know how fragile this progress is. In 2024, racial and gender diversity in Hollywood decreased for the first time in six years, a disappointing but unsurprising result in this current socio-political climate. Efforts to diversify various industries, including entertainment, have been met with a strong backlash in recent years.\r\n\r\n\r\nBut seeing ourselves represented in an accurate and meaningful way feels good; it makes us feel less lonely in our experiences.\r\n\r\n\r\nSometimes, these movies have helped me embrace my own identity. Crazy Rich Asians (2018) was the first movie I ever watched in theaters with my immigrant parents. Seeing Constance Wu portray an ABC—American-born Chinese—reminded me of my own ABC experiences. Wu’s character, Rachel, struggles to prove she’s “Chinese” enough while also embracing her American identity—a challenge that I resonated with, having just returned from my first solo trip to China. \r\n\r\n\r\nOther times, I’ve related to seeing Asian families connect over food and culture. In Shang-Chi and the Legend of the Ten Rings (2021), Shang-Chi and Katy eat traditional Chinese breakfast and struggle to speak “Chinglish” (Chinese-English) to her grandma. This scene reminded me of my family eating congee, salted egg, and pickled vegetables together, and now the dozens of other people in the theater were now getting a glimpse into my family’s Sunday morning tradition.\r\n\r\n\r\nBeyond just seeing ourselves represented, Asian-centered movies reflect a reality of my life.\r\n\r\n\r\nLast Saturday, my friends and I gathered for mahjong game night; we bickered over rules as we tried to recall what our grandparents taught us in our childhoods. Earlier that night, I had been on the phone with my mom, asking for tips while attempting to recreate my childhood favorite dish, stir-fried rice cakes. We chat in Shanghainese, and I’m painfully aware that this is one of the few times where I get to practice my first language.\r\n\r\n\r\nThese moments may seem mundane, but they’ve shaped my Asian American experience—and seeing these snapshots so thoughtfully reflected on the big screen is a powerful affirmation of just how important they are.","methodology":"Our main data source was Luminate Data, a database for music and entertainment data that was previously part of the Nielsen Media Research. Luminate Data includes information on actors' background and ethnicities, movies they were in, and details about each movie. \r\n\r\n\r\nUsing the advanced search feature, we compiled a list of actors that satisfied the conditions of: Films, in Development OR Released Films, Genre is Action OR Comedy OR Drama OR Horror OR Sci Fi/Fantasy OR Thriller, Keywords like Asian Lead Cast, Production Status is Completed, Country of Origin(s) United States, Release Type is THEATRICAL, WIDE, do not include Inactive records. \r\n\r\n\r\nWe then filtered based on the ScreenScore metric, a 1-100 scoring system that considers factors such as popularity of actors in terms of search frequency, significance of movies they’ve been in, and any awards received. We referenced this as a score of how popular and relevant an actor was, and a call with the representative at Luminate helped us determine that a score of 60 was a reasonable cutoff for actor relevancy. Filtering this initial search for only actors with a ScreenScore of 60+ left us with 83 actors. \r\n\r\n\r\nOf the 83 actors, we identified all the movies where they were a Main Title Actor, which we then whittled down to movies that had a box office debut that did at least $1,000,000 USD, resulting in 371 movies (spreadsheet). \r\n\r\n\r\nThen came the hard part: we needed to identify the movies that not only had Asian Main Actors, but also storylines where Asian characters had ethnicities that mattered. While inherently a subjective process, we considered factors such as characters speaking Asian languages, interacting with family, participating in cultural/religious activities, or any storylines based in Asian history. We also referenced actor interviews or other online articles that discussed “accurate” representation of the cultures. This brought our list from 371 to 76 movies (spreadsheet).\r\n\r\n\r\nOur final dataset was all 221 Asian characters (spreadsheet) and Main Title Actors in the 76 films, comparing ethnicity of characters to that of the actors who played them. There were 11 characters across six movies who we could not determine a specific ethnicity for a character, which we removed from the character/actor data. \r\n\r\n\r\nThere are a few limitations to our methods, firstly that we started with a list of prominent Asian actors and the movies they were in. This eliminated movies such as the Joy Luck Club, which is undoubtedly an important movie about the Asian American experience, but did not feature any prominent Asian actors. We chose to only look at movies that had a box office debut, which we determined to be the easiest means of measuring impact and popularity. We did not include any TV shows or streaming. With movies that were determined to have storylines where a character’s ethnicity was relevant, this was an inherently subjective process. We referenced online articles, actor interviews, movie transcripts, and our best judgment to try and categorize these films. \r\n\r\n\r\nA few caveats with the data, we only looked through movies that were released through 2023. We also categorized actors who were more than one ethnicity to be “multiethnic” in our data. If an actor had at least a partial ethnicity match with a character they played, we considered that a match."}