{"start":[{"visible_years":"1982-1995","opaque_years":"1982-1995","highlight_movies":"2","text":"Through the late 1960s, Hollywood was still using white actors in “yellowface” to portray Asian people. So the 1980s marked an important breakthrough, when films like <span>Indiana Jones and the Temple of Doom (1984)</span> starred child actor Ke Huy Quan alongside some of Hollywood’s biggest names."},{"visible_years":"1982-1995","opaque_years":"1982-1995","highlight_movies":"78","text":"Then came <span>The Joy Luck Club (1993)</span>, a landmark movie that was the first to feature a majority Asian American cast. The movie follows four Chinese American mothers and daughters, highlighting the complexities of immigration. Asian Americans were excited to see this previously untold perspective, driving the film to earn nearly $33 million at the box office."},{"visible_years":"1982-1995","opaque_years":"1982-1995","highlight_movies":"78","text":"This film also helped these Asian actresses find their footing in Hollywood, with Ming-Na Wen, who plays June, describing this movie as being her “green card to Hollywood”. \r\n\r\n\r\nDespite the film’s success, director Wayne Wang struggled to gain momentum in directing more Asian stories, and <span>The Joy Luck Club (1993)</span> was the only movie of its kind for many decades."},{"visible_years":"1982-2009","opaque_years":"1996-2009","highlight_movies":"15","text":"The late 1990s and early 2000s were then pivotal for Asian representation in the US. Movies like <span>Crouching Tiger, Hidden Dragon (2000)</span> brought Asian stories to mainstream audiences, while stars including Michelle Yeoh, Jackie Chan, and Tony Leung Chiu-wai began to build prominent, international careers. For the first time, a surge of Asian stars were driving significant box office success."},{"visible_years":"1982-2009","opaque_years":"1996-2009","highlight_movies":"4,34","text":"Still, this representation didn’t always make us proud. Many Asian main characters were still confined to stereotypes, such as Jackie Chan being a martial artist in <span>Rush Hour (1998)</span> or the “oriental” women in <span>Memoirs of a Geisha (2005)</span>."},{"visible_years":"1982-2023","opaque_years":"2010-2023","highlight_movies":"","text":"The 2010s then saw Asian representation expanded into smaller roles and more in-depth characterization. In the past 16 years, the percentage of Asian characters with speaking roles increased from 3.4% to 15.9%, outpacing growth of any other ethnic group in Hollywood."},{"visible_years":"1982-2023","opaque_years":"2010-2023","highlight_movies":"69,63,71","text":"At the same time, movies starring Asian Americans have started to show a multifaceted portrayal of experiences, going beyond stereotypes and tokenized characters. Recent films like <span>Past Lives (2023)</span>, <span>Shang-Chi and the Legend of the Ten Rings (2021)</span>, and <span>Joy Ride (2023)</span> have highlighted a diverse set of stories across all genres."}],"end":[{"visible_years":"1982-2023","opaque_years":"1982-2023","highlight_movies":"","text":"We started with the 80 films and XXX characters in our dataset."},{"visible_years":"1982-2023","opaque_years":"1982-2023","highlight_movies":"","characteristic_shown":"isFullyAccurate","characteristic_dim":"isPartiallyAccurate,isFullyInaccurate","text":"Out of 80 movies we looked at, 64 were cast with <span class='accurate'>complete accuracy</span>.\r\n\r\n\r\nTo be honest, this was a much higher portion than we’d anticipated!"},{"visible_years":"1982-2023","opaque_years":"1982-2023","highlight_movies":"","characteristic_shown":"isFullyAccurate,isPartiallyAccurate","characteristic_dim":"isFullyAccurate,isFullyInaccurate","text":"Meanwhile, 13 movies were cast with <span class='partial_accurate'>partial accuracy</span>."},{"visible_years":"1982-2023","opaque_years":"1982-2023","highlight_movies":"","characteristic_shown":"isFullyAccurate,isPartiallyAccurate,isFullyInaccurate","characteristic_dim":"isFullyAccurate,isPartiallyAccurate","text":"And only 3 out of the 80 movies were cast <span class='fully_inaccurate'>completely inaccurately</span>.\r\n\r\n\r\nThese three films were more obscure—and chances are, you’ve never even heard of them, like Missing in Action (1984) or A Hologram for the King (2016)."},{"visible_years":"1982-2023","opaque_years":"1982-2023","highlight_movies":"","characteristic_shown":"isFullyAccurate,isPartiallyAccurate,isFullyInaccurate","characteristic_dim":"isFullyAccurate,isPartiallyAccurate","text":"Notably, it’s not an Asian actor’s fault that they are playing a character of a different ethnicity. In the past, being Asian greatly limited the types of roles available in Hollywood, so actors had to take what was available to them in a white-centric industry."},{"visible_years":"1982-2023","opaque_years":"1982-2023","highlight_movies":"","characteristic_shown":"isFullyAccurate,isPartiallyAccurate,isFullyInaccurate","characteristic_dim":"","text":"All in all, of the 236 Asian main characters, 208—88%—were portrayed by actors of the same ethnic background.\r\n\r\n\r\nIn other words, Hollywood does a surprisingly good job ensuring that Asian characters are played by an actor of that character’s ethnicity."},{"visible_years":"1982-2023","opaque_years":"1982-2023","highlight_movies":"","characteristic_shown":"isFullyAccurate,isPartiallyAccurate,isFullyInaccurate","characteristic_dim":"","text":"There were some factors that influenced accurate—and inaccurate—casting. Specifically, do different production studios and directors impact accuracy of casting?"},{"visible_years":"1982-2023","opaque_years":"1982-2023","highlight_movies":"","characteristic_shown":"isFullyAccurate,isPartiallyAccurate,isFullyInaccurate","characteristic_dim":"isNotBig5","text":"The “Big Five” production studios—Universal, Paramount, Warner Bros., Disney, and Sony—control nearly 85% of the movie market share, yet were behind just 39% of the 80 movies, reflecting a lack of investment in Asian stories."},{"visible_years":"1982-2023","opaque_years":"1982-2023","highlight_movies":"37,63","characteristic_shown":"isFullyAccurate,isPartiallyAccurate,isFullyInaccurate","characteristic_dim":"isNotBig5","text":"Still, “Big Five” movies like <span>Crazy Rich Asians (2018)</span> and <span>Shang-Chi and the Legend of the Ten Rings (2021)</span> made waves with their representation. With more resources, these large studios have the means to reach mainstream audiences and feature bigger stars.\r\n\r\n\r\nIt’s also worth noting that of the Asian movies that these studios did invest in, casting accuracy was on par with other movies, with accuracy of 86%."},{"visible_years":"1982-2023","opaque_years":"1982-2023","highlight_movies":"","characteristic_shown":"isFullyAccurate,isPartiallyAccurate,isFullyInaccurate","characteristic_dim":"isNotAsianDirector","text":"Meanwhile, movies with Asian directors had a 94% accuracy rate across 101 main characters.\r\n\r\n\r\nAsian directors have directed more Asian movies compared to the past, and this has reached an all-time high in recent years. It’s clear that when Asian filmmakers get to lead these stories, casting is done with more intentionality and accuracy."},{"visible_years":"1982-2023","opaque_years":"1982-2023","highlight_movies":"66","characteristic_shown":"isFullyAccurate,isPartiallyAccurate,isFullyInaccurate","characteristic_dim":"isNotAsianDirector","text":"Asians directors have also recently begun receiving more recognition, with <span>Everything Everywhere All At Once (2022)</span> director Daniel Kwan becoming the first Asian director to win the Oscar for Best Director for an Asian-led film."},{"visible_years":"1982-2023","opaque_years":"1982-2023","highlight_movies":"","characteristic_shown":"isFullyAccurate,isPartiallyAccurate,isFullyInaccurate","characteristic_dim":"","text":"Hover on the chart to explore the films."}]}